{
  "type": "code_pattern",
  "importance": "high",
  "content": "Die CategoryForm in apps/frontend-new/src/components/categories/CategoryForm.tsx wurde gemäß den Anforderungen angepasst:\n\n1. Die Reihenfolge der Elemente wurde geändert: Die Switches wurden unterhalb des Rollen-Auswahlfelds platziert und horizontal nebeneinander angeordnet. Dies wurde mit einem Flex-Container mit justifyContent=\"space-between\" und wrap=\"wrap\" umgesetzt, um eine responsive Anordnung zu gewährleisten.\n\n2. Das Rollen-Auswahlfeld wurde auf eine angemessene Höhe (height: \"120px\") eingestellt, während es weiterhin die volle Breite des Modals einnimmt (width: \"100%\"). Dies bietet ausreichend Platz für die Anzeige und Auswahl der verfügbaren Rollen.\n\n3. Die Rollenchips wurden in einer ausgewogenen Größe gestaltet:\n   - Angemessene Schriftgröße: fontSize: \"xs\"\n   - Passende Polsterung: px={2}, py={0.5}\n   - Optimale Höhe: height=\"22px\"\n   - Minimale Breite: minWidth=\"auto\"\n   - Kompakte Abstände: mb={0.5}, mr={1}\n   - Geringer Abstand zwischen den Chips: gap={1}\n   - Die Chips verwenden das gleiche Grün wie der Speichern-Button (bg=\"button.modalPrimary.bg\", color=\"button.modalPrimary.color\"). Die Farbe entspricht dem Wert #90FF00 (navActiveGreenBase).\n\n4. Der CloseButton in den Rollenchips wurde passend dimensioniert:\n   - Größe: size=\"xs\"\n   - Feste Größe: boxSize=\"14px\"\n   - Angemessener Abstand: ml={0.5}\n\nDiese Änderungen verbessern die visuelle Hierarchie und Konsistenz des Formulars, indem sie die Rollen als Hauptelement hervorheben und die Switches als sekundäre Optionen darunter platzieren. Die Verwendung des gleichen Grüns für die Rollenchips wie für den Speichern-Button schafft eine visuelle Verbindung zwischen den ausgewählten Rollen und der Speichern-Aktion. Die Chips sind nun in einer optimalen Größe, die sowohl gut lesbar als auch kompakt ist.",
  "tags": ["UI", "Form", "CategoryForm", "Layout", "Styling", "Switches", "Roles", "Chips", "Green", "Horizontal Layout"],
  "metadata": {
    "source": "UI Implementation",
    "created": "2023-11-15",
    "updated": "2023-11-15",
    "files_modified": [
      "apps/frontend-new/src/components/categories/CategoryForm.tsx"
    ]
  }
}