{
  "type": "architectural",
  "importance": "critical",
  "content": "Project Chimera ist ein modulares Discord Bot-System mit Web-Dashboard, das tiefgreifende Werkzeuge für Community-Management, Benutzerengagement durch Gamification und spezialisierte Funktionen wie dynamische Sprachkanäle und einen integrierten Marktplatz bietet. Der Technologie-Stack umfasst React/Next.js (Frontend), Nest.js (Backend), Supabase (Datenbank/Auth) und TypeScript. Das Frontend verwendet Chakra UI v3 mit einem ausgefeilten Theming-System, während das Backend eine modulare Struktur mit klaren Service-Verantwortlichkeiten hat. Die Authentifizierung erfolgt über Discord OAuth2, und das System operiert auf drei Kontext-Ebenen: Allianz (mehrere Discords), Guild (Standard) und Gruppen (innerhalb eines Discords). Das Berechtigungskonzept wurde überarbeitet, um Permissions direkt an Discord-Rollen oder User zu binden. Hauptfunktionen sind: 1) Dynamic Voices & Tracking (Kategorien, Zonen, Setup-Flow, Tracking, Punkte), 2) Voice Kanal Manager, 3) Warenwirtschaft/Handel und 4) Verwaltung. Besonders komplex ist die Zwei-Wege-Synchronisation zwischen Discord und Datenbank sowie der Setup-Flow für dynamische Kanalerstellung. Das MVP fokussiert sich auf das Kernsystem, Dynamic Voices & Tracking auf Guild-Level und eine Basisversion der Warenwirtschaft. Die REST API-Endpunkte sind in sechs Hauptkategorien unterteilt und durch einen PermissionGuard geschützt. Das Datenbankschema umfasst Tabellen für Core & Authentifizierung, Level-Architektur, Berechtigungen, Dynamic Voices & Tracking, Warenwirtschaft und Verwaltung. Für das Rate Limit Handling bei Kanalnamen-Änderungen wird eine Kombination aus BullMQ, Redis Hash und @upstash/ratelimit verwendet. Das Frontend-Dashboard bietet ein einzigartiges 'WOW'-Erlebnis durch flüssige Animationen und responsive Design, mit Kern-UI-Komponenten wie NotchedBox, ContentBox, FilterDropdown und FilterBar.",
  "tags": ["Discord Bot", "Web-Dashboard", "Nest.js", "React", "Next.js", "Supabase", "TypeScript", "Chakra UI v3", "Dynamic Voices", "Tracking", "Warenwirtschaft", "Berechtigungssystem", "Rate Limiting", "MVP", "REST API", "Datenbankschema", "NotchedBox", "Discord OAuth2"],
  "metadata": {
    "source": "Konsolidierte Analyse aller Dokumente",
    "created": "2023-11-15"
  }
}